#pragma once
#include <string>

const std::string LAB_TASK = "ќбщие требовани€ : в начале программы вывести задание;\n\
в процессе работы выводить подсказки пользователю\n\
(что ему нужно ввести, чтобы продолжить выполнение программы).\n\
ѕосле работы программы вс€ динамически выделенна€ пам€ть должна быть освобождена.\n\
 ласс коллекци€ должна иметь методы дл€ изменени€ количества хранимых объектов :\n\
добавление в конец, вставка, усечение, удаление из середины.\n\
ѕри обращении к элементам с несуществующим индексом или\n\
при некорректном изменении количества должно выбрасыватьс€ исключение.\n\
¬заимодействие с пользователем организовать в виде простого меню,\n\
обеспечивающего возможность переопределени€ исходных данных и завершение работы программы.\n\
15. Ќаписать программу, в которой описана иерархи€ классов : геометрические фигуры\n\
(круг, параллелепипед, трапеци€).ќписать шаблонный класс дл€ хранени€ массива\n\
указателей на объекты произвольного класса, в шаблонном классе перегрузить операцию Ђ[]ї.\n\
ѕродемонстрировать работу операторов и использование шаблонного класса с различными классами.\n";
